const posts = [
    {
        id: 1,
        cover: "p", 
        text: "Глобальный отчет: Цифровые экосистемы требуют немедленной защиты. Новые данные показывают критическую уязвимость открытых сетей.",
        author: "Команда Veridian",
        social: [
            { url: "#", icon: "VK" },
            { url: "#", icon: "TG" }
        ],
        date: "04.06.2026 14:30"
    },
    {
        id: 2,
        cover: "https://images.unsplash.com/photo-1550751827-4bd374c3f58b?q=80&w=1000&auto=format&fit=crop",
        text: "Операция «Чистый Код» завершена. Мы удалили более 5000 вредоносных узлов из глобальной сети. <a href='#'>Читать полный отчет</a>",
        author: "Алексей Морозов",
        social: [
            { url: "#", icon: "X" },
            { url: "#", icon: "LI" },
            { url: "#", icon: "TG" }
        ],
        date: "03.06.2026 09:15"
    },
    {
        id: 3,
        text: "Срочное заявление: Обнаружена новая волна фишинговых атак, маскирующихся под благотворительные фонды. Будьте бдительны.",
        author: "Служба безопасности",
        social: [
            { url: "#", icon: "TG" }
        ],
        date: "01.06.2026 18:45"
    }
];
